import jieba
def count(nonewords,usefulnames):
    txt=open("threekingdoms.txt","r",encoding="UTF-8").read()
    words=jieba.lcut(txt)#这是jieba的字符串的分割函数
    names={}
    for word in words:
        if len(word)==1 or word in nonewords:#除去一些无用的字符
            continue
        else:
            names[word] = names.get(word,0)+1#初步查询人物名字，并添加到字典
            #合并个人的不同名称
    for usefulname in usefulnames:
        for name in usefulname[1]:#将同一人物的不同称号赋值给name
            names[usefulname[0]] += names.get(name,0)#将这些不同称号的数量统计起来然后给添加到人物名字的出现次数中
            del names[name]#删除那些称号的键对值
    namelist =list(names.items())#将字典中值给统计为一个列表
    namelist.sort(key= lambda x :x[1],reverse=True)#将名字数量正序排列
    return namelist
nonewords = {'却说','二人','不可','主公','陛下','汉中','只见','众将','后主','蜀兵','上马','大叫','太守','此人','夫人',
 '先主','后人','背后','城中','天子','一面','何不','大军','忽报','先生','百姓','何故','不能','如此','如何',
 '然后','先锋','不如','赶来','原来','令人','江东','下马','喊声','正是','徐州','忽然','荆州','左右','军马',
 '因此','成都','不见','未知','大败','大事','之后','一军','引军','起兵','军中','接应','引兵','次日','大喜',
 '进兵','大惊','可以','以为','大怒','不得','心中','下文','一声','追赶','粮草','天下','东吴','于是','都督',
 '曹兵','一齐','分解','回报','分付','只得','出马','三千','大将','许都','随后','报知','今日','不敢','魏兵',
 '前面','之兵','且说','众官','洛阳','领兵','商议','军士','星夜','精兵','城上','之计','不肯','相见','其言',
 '一日','而行','文武','襄阳','准备','若何','出战','亲自','必有','一人','人马','不知','何人','此事','之中',
 '伏兵','祁山','乘势','忽见','大笑','樊城','兄弟','首级','立于','西川','传令','当先','五百','一彪','坚守',
 '此时','之间','投降','五千','埋伏','长安','三路','遣使','将军','关兴','军师','朝廷','三军','大王','回见',
 '大将军','必然','将士','是夜','小路' }
usefulnames = [ 
['刘备',('玄德','玄德曰','玄德问','刘玄德','玄德大','玄德自','玄德闻','皇叔','刘皇叔')],
['关羽',('关公','云长','关云长')],
['孔明',('诸葛亮','孔明曰','孔明笑','孔明之','孔明自')],
['曹操',('丞相','孟德','曹公','曹孟德')],
['张飞',('翼德','张翼德')]
]
namelist = count(nonewords,usefulnames)#调用函数
for i in range(10):
    word,count =namelist[i]
    print("{0:<10}{1:<7}{2:<10}".format(i+1,word,count))
